#### STEP II : FEATURE ENGINEERING

### Step 2.1 - Import Libraries

In [6]:
import pandas as pd
import numpy as np

### Step 2.2 - Load Cleaned Dataset

In [20]:
df = pd.read_csv(r"C:\Users\Priya\Desktop\Speedup\Data Science\All_Data_Science_Projects\Python_Packages\AI_based_Resume_Screening\cleaned_resumes.csv",keep_default_na=False)
df.head()

,Resume_ID,Name,Skills,Experience_Years,Education,Certifications,Job_Role,Recruiter_Decision,Salary_Expectation_Dollars,Projects_Count,AI_Score
0,1,Ashley Ali,"TensorFlow, NLP, Pytorch",10,B.Sc,None,AI Researcher,Hire,104895,8,100
1,2,Wesley Roman,"Deep Learning, Machine Learning, Python, SQL",10,MBA,Google ML,Data Scientist,Hire,113002,1,100
2,3,Corey Sanchez,"Ethical Hacking, Cybersecurity, Linux",1,MBA,Deep Learning Specialization,Cybersecurity Analyst,Hire,71766,7,70
3,4,Elizabeth Carney,"Python, Pytorch, TensorFlow",7,B.Tech,AWS Certified,AI Researcher,Hire,46848,0,95
4,5,Julie Hill,"SQL, React, Java",4,PhD,None,Software Engineer,Hire,87441,9,100

In [22]:
df.isnull().sum()

Resume_ID                     0
Name                          0
Skills                        0
Experience_Years              0
Education                     0
Certifications                0
Job_Role                      0
Recruiter_Decision            0
Salary_Expectation_Dollars    0
Projects_Count                0
AI_Score                      0
dtype: int64

### Step 2.3 - Check Data

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Resume_ID                   1000 non-null   int64
 1   Name                        1000 non-null   object
 2   Skills                      1000 non-null   object
 3   Experience_Years            1000 non-null   int64
 4   Education                   1000 non-null   object
 5   Certifications              1000 non-null   object
 6   Job_Role                    1000 non-null   object
 7   Recruiter_Decision          1000 non-null   object
 8   Salary_Expectation_Dollars  1000 non-null   int64
 9   Projects_Count              1000 non-null   int64
 10  AI_Score                    1000 non-null   int64
dtypes: int64(5), object(6)
memory usage: 86.1+ KB

### Step 2.4 - Skills Column Cleaning

In [24]:
df["Skills"]

0                               TensorFlow, NLP, Pytorch
1           Deep Learning, Machine Learning, Python, SQL
2                  Ethical Hacking, Cybersecurity, Linux
3                            Python, Pytorch, TensorFlow
4                                       SQL, React, Java
                             ...
995                Cybersecurity, Linux, Ethical Hacking
996                      Deep Learning, Machine Learning
997                                      TensorFlow, NLP
998    Linux, Networking, Cybersecurity, Ethical Hacking
999         SQL, Machine Learning, Python, Deep Learning
Name: Skills, Length: 1000, dtype: object

In [25]:
df["Skills"] = df["Skills"].str.lower()

In [28]:
df["Python_Skill"] = df["Skills"].str.contains("python").astype(int)
df["SQL_Skill"] = df["Skills"].str.contains("sql").astype(int)
df["ML_Skill"] = df["Skills"].str.contains("machine learning").astype(int)
df["PowerBI_Skill"] = df["Skills"].str.contains("power bi").astype(int)
df["Excel_Skill"] = df["Skills"].str.contains("excel").astype(int)
df["TensorFlow_Skill"] = df["Skills"].str.contains("tensorflow").astype(int)
df["NLP_Skill"] = df["Skills"].str.contains("nlp").astype(int)
df["Pytorch_Skill"] = df["Skills"].str.contains("pytorch").astype(int)

### Step 2.5 Convert Recruiter Decision to numeric

In [29]:
df["Recruiter_Decision"] = df["Recruiter_Decision"].map({"Hire": 1, "Reject": 0})

In [30]:
df["Recruiter_Decision"].value_counts()

Recruiter_Decision
1    812
0    188
Name: count, dtype: int64

### Step 2.6 Create Experience Level column

In [45]:
df["Experience_Years"] = pd.to_numeric(df["Experience_Years"], errors="coerce")

def exp_level(years):
    if years <= 1:
        return "Fresher"
    elif 2 <= years <= 4:
        return "Junior"
    elif 5 <= years <= 7:
        return "Mid"
    else:  # 8+ years
        return "Senior"

df["Experience_Level"] = df["Experience_Years"].apply(exp_level)

In [46]:
df[["Experience_Years", "Experience_Level"]].head()

   Experience_Years Experience_Level
0                10           Senior
1                10           Senior
2                 1          Fresher
3                 7              Mid
4                 4           Junior

In [47]:
df.isnull().sum()

Resume_ID                       0
Name                            0
Skills                          0
Experience_Years                0
Education                       0
Certifications                274
Job_Role                        0
Recruiter_Decision              0
Salary_Expectation_Dollars      0
Projects_Count                  0
AI_Score                        0
Python_Skill                    0
SQL_Skill                       0
ML_Skill                        0
PowerBI_Skill                   0
Excel_Skill                     0
TensorFlow_Skill                0
NLP_Skill                       0
Pytorch_Skill                   0
Experience_Level                0
dtype: int64

In [34]:
df.to_csv("feature_engineered_resumes.csv", index=False)

# ------------------------------------------
# SQL Queries on Resumes Dataset
# ------------------------------------------

## Load dataset into SQLite

In [36]:
import sqlite3
import pandas as pd

# Load the feature engineered CSV
df = pd.read_csv("feature_engineered_resumes.csv")

# Connect to an in-memory SQLite database
conn = sqlite3.connect(":memory:")

# Load dataframe as SQL table
df.to_sql("resumes", conn, index=False, if_exists="replace")

1000

### Candidates with Python skill

In [37]:
query = """
SELECT Name, Skills, Experience_Years, Recruiter_Decision
FROM resumes
WHERE Python_Skill = 1
"""
python_candidates = pd.read_sql(query, conn)
python_candidates.head()

,Name,Skills,Experience_Years,Recruiter_Decision
0,Wesley Roman,"deep learning, machine learning, python, sql",10,1
1,Elizabeth Carney,"python, pytorch, tensorflow",7,1
2,Courtney Gibson,"python, tensorflow, pytorch, nlp",0,0
3,Megan Brown,"sql, python",10,1
4,Jonathon Pineda,"sql, python, deep learning",3,1

### Candidates with ML skill and experience > 2 years

In [38]:
query = """
SELECT Name, Skills, Experience_Years, Recruiter_Decision
FROM resumes
WHERE ML_Skill = 1 AND Experience_Years > 2
"""
ml_candidates = pd.read_sql(query, conn)
ml_candidates.head()

,Name,Skills,Experience_Years,Recruiter_Decision
0,Wesley Roman,"deep learning, machine learning, python, sql",10,1
1,Jennifer Collins,"machine learning, sql, python",10,1
2,William Clark,"machine learning, deep learning, sql",4,1
3,Elizabeth Serrano,"deep learning, machine learning, sql, python",8,1
4,Tanya West,"sql, python, machine learning",4,1

### Candidates with both Python and SQL skills

In [39]:
query = """
SELECT Name, Skills, Experience_Years
FROM resumes
WHERE Python_Skill = 1 AND SQL_Skill = 1
"""
py_sql_candidates = pd.read_sql(query, conn)
py_sql_candidates.head()

,Name,Skills,Experience_Years
0,Wesley Roman,"deep learning, machine learning, python, sql",10
1,Megan Brown,"sql, python",10
2,Jonathon Pineda,"sql, python, deep learning",3
3,Jennifer Collins,"machine learning, sql, python",10
4,Steven Thomas,"sql, python",10

### Count of candidates by experience level

In [40]:
query = """
SELECT Experience_Level, COUNT(*) as Candidate_Count
FROM resumes
GROUP BY Experience_Level
"""
experience_count = pd.read_sql(query, conn)
experience_count

  Experience_Level  Candidate_Count
0          Fresher              191
1           Junior              188
2              Mid              274
3           Senior              347

### Candidates with more than 2 projects

In [41]:
query = """
SELECT Name, Projects_Count, Recruiter_Decision
FROM resumes
WHERE Projects_Count > 2
"""
experienced_candidates = pd.read_sql(query, conn)
experienced_candidates.head()

              Name  Projects_Count  Recruiter_Decision
0       Ashley Ali               8                   1
1    Corey Sanchez               7                   1
2       Julie Hill               9                   1
3  Samantha Santos               5                   1
4       Tony Smith               9                   1